---
type: IOpenFromCloudCallback
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# IOpenFromCloudCallback

`Autodesk.Revit.DB.IOpenFromCloudCallback` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | OnOpenConflict | 2019 | `OpenConflictResult OnOpenConflict ( OpenConflictScenario scenario )` |